app/Controllers/Berita.php

    public function index()
    {
        $data = $this->model->orderBy('Judul_berita', 'asc')->findAll();
---
SELECT *
FROM `berita`
ORDER BY `Judul_berita` ASC

    public function show($id = null)
    {
        $data = $this->model->where('Id_berita', $id)->findAll();
---
SELECT *
FROM `berita`
WHERE `Id_berita` = '1'

    public function delete($id = null)
    {
        $data = $this->model->where('Id_berita', $id)->findAll();
        if ($data) {
            $this->model->delete($id);
---
SELECT *
FROM `berita`
WHERE `Id_berita` = '10'
DELETE FROM `berita`
WHERE `Id_berita` IN ('10')